UserDataInfo={}
function UserDataInfo:new(dataArr)
	local o = { }
	o.id=dataArr[1]
	o.name=dataArr[2]
	o.lng=dataArr[3]
	o.lat=dataArr[4]
	o.sex=dataArr[5]
	o.activeLevel=dataArr[6]
	o.level=dataArr[7]
	o.signiture=dataArr[8]
	o.distance=dataArr[9]
	o.location=dataArr[10]
	o.age=dataArr[11]
	o.job=dataArr[12]
	o.identification=dataArr[13]
	o.assest=dataArr[14]
	o.redBag=dataArr[15]
	o.point=dataArr[16]
	o.gain=dataArr[17]
	o.head=dataArr[18]
	return o
end

UserDataTable = {}
local this  = UserDataTable
local initSign = false
local infoData = {}

function this:getInfo(id)
	if initSign==false then
		self:init()
	end
	return infoData[tostring(id)]
end

function this:init()
	initSign=true
	for i=1,#UserDataTable.data do
		local info =UserDataInfo:new(UserDataTable.data[i])
		infoData[tostring(info.id)]=info
	end
end

UserDataTable.data={
	{10001,"蓝色妖姬音乐",113.373585169909,23.1042806484372,2,1,2,"神一样的心灵，树一样的人。",0,"广东·广州",31,"调酒师","富豪",116,104,77,139,5},
	{10002,"冷酷的云",113.378560485674,23.1015342329392,1,3,3,"我心向明月，奈何明月照沟渠。",0,"广东·广州",17,"艺术家","地主",19,13,14,50,2},
	{10003,"一条寂寞的鱼",113.371570401157,23.102019820128,1,2,2,"天哪！我的衣服又瘦了",0,"广东·广州",17,"化妆师","大亨",734,441,1070,2177,1},
	{10004,"我心寂寞",113.363207121034,23.1057828581062,1,2,3,"屁是什么，就吃你吃下去食物们不屈的灵魂！！",0,"广东·广州",20,"金融","大师",90,57,51,265,4},
	{10005,"沉默的熊",113.376653907549,23.1069787169862,1,1,3,"快乐如同黑色的天，每天伴随你！",0,"广东·广州",37,"金融","天王",633,448,490,1814,3},
	{10006,"飞跃",113.379764013414,23.1069998587873,2,1,1,"生活在于精彩，生命在于蓬勃",0,"广东·广州",21,"音乐家","强人",491,420,462,934,3},
	{10007,"睡梦中的雄师",113.363179425401,23.0958598726539,2,1,2,"自从交了电费，我觉得觉睡不好了，饭吃不下了，茶也喝不下了。",0,"广东·广州",35,"艺术家","新人",91,73,100,142,3},
	{10008,"梦剑",113.366069968089,23.0995115642909,1,2,2,"孔子说：“今天天气很晴朗！处处好风光”。孟子说：“孔子说的对”。",0,"广东·广州",20,"糕点师","至尊",356,324,507,920,4},
	{10009,"月色朦胧",113.371891442289,23.1035951895313,2,3,1,"快乐的人不是没有痛苦，而是不会被痛苦所左右。",0,"广东·广州",28,"甜品师","富豪",41,21,52,93,1},
	{10010,"月伴终生",113.375257705736,23.1056339230024,2,2,2,"还在猜测TA喜不喜欢你吗？跟你分享一个小秘籍戳这里~一分钟告诉你：你们会不会在一起？",0,"广东·广州",22,"运动员","地主",492,284,580,1371,5},
	{10011,"今世伴明月",113.363716152378,23.0983612572638,2,3,3,"世界上最勇敢的事情是微笑着听你说你们之间的爱情...",0,"广东·广州",32,"外交官","大亨",294,253,409,706,3},
	{10012,"月中真情",113.363144775003,23.0983204676965,2,1,2,"你有神马不开心的事说出来让我们开心一下",0,"广东·广州",32,"舞蹈家","大师",447,277,636,533,3},
	{10013,"除魔天地间",113.372568147482,23.1077985431712,2,2,1,"快乐是一种心态，不是一种状态",0,"广东·广州",24,"游戏策划","天王",177,157,110,329,5},
	{10014,"醉里挑灯看剑",113.363373199506,23.098395456472,1,3,3,"只想优雅转身不料华丽撞墙",0,"广东·广州",21,"歌手","强人",528,455,709,1341,5},
	{10015,"残破的羽翼",113.365146580251,23.1043516548436,2,3,3,"不在课堂上沉睡，就在酒桌上埋醉～",0,"广东·广州",18,"演员","新人",442,374,585,485,4},
	{10016,"尘封记忆",113.378251113873,23.1078495692299,1,3,1,"天哪！我的衣服又瘦了",0,"广东·广州",25,"产品经理","至尊",535,485,480,1575,4},
	{10017,"飘雪无垠",113.376829077446,23.1089590484259,1,2,1,"我们的关系没有关系。",0,"广东·广州",35,"UI设计","富豪",515,494,737,1306,2},
	{10018,"风枫",113.365223622253,23.0963070661471,2,3,3,"世界上最勇敢的事情是微笑着听你说你们之间的爱情...",0,"广东·广州",32,"弹钢琴","地主",779,393,975,1792,2},
	{10019,"雪中无处寻",113.380055731655,23.1039227279148,1,1,1,"终究要亲自受伤，才会学着聪明。",0,"广东·广州",19,"古筝手","大亨",338,257,389,878,2},
	{10020,"花开无声",113.367430935899,23.0958759916929,1,3,1,"我深信，会有一个男人是为受我的折磨而来到这世上的。",0,"广东·广州",39,"设计师","大师",513,316,371,989,4},
	{10021,"风过无痕",113.366193959793,23.100012090009,1,2,3,"一个人没爱过之前叫做孤单.爱过之后叫做寂寞",0,"广东·广州",27,"酒吧老板","天王",865,475,842,1399,1},
	{10022,"倚窗听雨",113.372587720635,23.1093106261486,2,1,3,"冬天里你给了我一个夏天的梦却把我在春天喊醒了",0,"广东·广州",26,"CEO","强人",552,418,392,956,2},
	{10023,"馨香泯玉",113.372544919722,23.1031065326488,1,2,1,"孤单是你心里面没有人！寂寞是你心里有的人却不在身边。",0,"广东·广州",39,"游乐园老板","新人",426,294,224,1203,3},
	{10024,"天籁",113.364199739277,23.1077970326195,2,1,2,"一念起，万水千山。一念灭，沧海桑田。",0,"广东·广州",25,"机长","至尊",112,79,78,127,4},
	{10025,"石上流音",113.379382099135,23.0964823368225,2,2,3,"从单纯到冷漠是怎样的疲惫?",0,"广东·广州",36,"记者","富豪",469,306,328,1211,2},
	{10026,"滴落的露珠",113.380304933302,23.1079627527039,2,2,3,"你来过一下子，我想念一辈子。",0,"广东·广州",33,"赛车手","地主",346,270,436,969,5},
	{10027,"高跟叩石",113.378075485712,23.1067603007903,2,2,3,"如果方向错了，停下来就是前进。",0,"广东·广州",26,"律师","大亨",312,162,194,520,5},
	{10028,"沁心",113.371169163918,23.0975642832018,2,3,1,"我多想一个不小心就和你白头偕老。",0,"广东·广州",23,"理发师","大师",274,262,221,435,4},
	{10029,"叶脉",113.374013582751,23.1040960964984,2,1,1,"神一样的心灵，树一样的人。",0,"广东·广州",23,"跆拳道教练","天王",364,247,227,365,5},
	{10030,"一滴",113.373880705558,23.1021028170182,1,3,3,"我心向明月，奈何明月照沟渠。",0,"广东·广州",22,"运动员","强人",498,478,698,1460,3},
	{10031,"江湖天籁",113.372675860032,23.1074825383854,2,2,3,"我们的关系没有关系。",0,"广东·广州",29,"兽医","新人",659,472,458,1906,5},
	{10032,"乐声幻境",113.380989752024,23.1049380605404,2,2,2,"屁是什么，就吃你吃下去食物们不屈的灵魂！！",0,"广东·广州",38,"特警 ","至尊",273,213,204,509,1},
	{10033,"音之天下",113.370100284709,23.0981527190941,1,3,3,"快乐如同黑色的天，每天伴随你！",0,"广东·广州",24,"按摩","富豪",449,235,306,518,2},
	{10034,"怡情已然",113.377161736721,23.1050175063555,1,3,2,"生活在于精彩，生命在于蓬勃",0,"广东·广州",27,"程序猿","地主",526,489,701,692,5},
	{10035,"弦乐飘飘",113.364194100686,23.1020571360099,2,2,2,"自从交了电费，我觉得觉睡不好了，饭吃不下了，茶也喝不下了。",0,"广东·广州",27,"程序员","大亨",567,383,419,617,1},
	{10036,"蓝色梦幻",113.374047010743,23.0956181699032,1,2,1,"孔子说：“今天天气很晴朗！处处好风光”。孟子说：“孔子说的对”。",0,"广东·广州",32,"原画","大师",63,57,93,105,4},
	{10037,"塞外旋音",113.369803017517,23.1073700997699,2,2,1,"快乐的人不是没有痛苦，而是不会被痛苦所左右。",0,"广东·广州",23,"医生","天王",605,486,308,834,5},
	{10038,"煮酒音乐",113.376301527912,23.0976311564146,2,1,3,"还在猜测TA喜不喜欢你吗？跟你分享一个小秘籍戳这里~一分钟告诉你：你们会不会在一起？",0,"广东·广州",33,"老板","强人",506,300,410,1021,4},
	{10039,"say_hi",113.373809089433,23.1094374713445,2,3,3,"不在课堂上沉睡，就在酒桌上埋醉～",0,"广东·广州",19,"建筑工","新人",318,175,201,327,3},
	{10040,"梦幻家园",113.368397799888,23.1082607561791,1,1,2,"你有神马不开心的事说出来让我们开心一下",0,"广东·广州",38,"学生","至尊",454,331,306,1273,5},
	{10041,"白鸟朝凤",113.373347487862,23.109427239464,2,2,3,"快乐是一种心态，不是一种状态",0,"广东·广州",34,"学生","富豪",241,193,321,590,2},
	{10042,"天音沙龙",113.378059003035,23.1003481249786,2,2,2,"只想优雅转身不料华丽撞墙",0,"广东·广州",22,"学生","地主",84,81,69,239,4}
}

